# MasonryCMUPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MasonryCMU..::..MasonryCMUPattern Property
MasonryCMU Class See Also
---
The property labeled "Relief Pattern" from the "MasonryCMU" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MasonryCMUPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MasonryCMUPattern As String
	Get
```

Visual C++
---
```text
public:
static property String^ MasonryCMUPattern {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".
# See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace